---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsRunStyle.Sketched
enum: Autodesk.Revit.DB.Architecture.StairsRunStyle
source: html/1dc06f71-259c-1fb1-2fd7-6fa449f628e0.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunStyle.Sketched

A sketched run can have customized boundary and riser curves. User can customize stair path as well.